Catalogs/ВидыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыОплатЧекаККМ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВРеализацияТоваровУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВСписаниеТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Наличные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыОплатЧекаККМ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтражатьВУправленческомУчетеПриИзменении(Элемент)
	
	Объект.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете Или (Не Объект.ОтражатьВУправленческомУчете);
	Объект.ОтражатьВНалоговомУчете = Объект.ОтражатьВБухгалтерскомУчете;
	
КонецПроцедуры // ОтражатьВУправленческомУчетеПриИзменении()

&НаКлиенте
Процедура ОтражатьВБухгалтерскомУчетеПриИзменении(Элемент)
	
	Объект.ОтражатьВУправленческомУчете = Объект.ОтражатьВУправленческомУчете Или (Не Объект.ОтражатьВБухгалтерскомУчете);
	Объект.ОтражатьВНалоговомУчете = Объект.ОтражатьВБухгалтерскомУчете;
	
КонецПроцедуры // ОтражатьВБухгалтерскомУчетеПриИзменении()

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)

	Используется = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Используется, "Р+С");
	
	Объект.ИспользоватьВРеализацияТоваровУслуг = (Используется = "Р") Или (Используется = "Р+С");
	Объект.ИспользоватьВСписаниеТоваров = (Используется = "С") Или (Используется = "Р+С");
	
КонецПроцедуры // ИспользуетсяПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Используется.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
	// Управленчиский учет.
	ИспользоватьУправленческийУчет = ПолучитьФункциональнуюОпцию("ИспользоватьУправленческийУчет");

	// Настройка формы.
	Элементы.ГруппаУчет.Видимость = ИспользоватьУправленческийУчет;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Используется.
	Если Объект.ИспользоватьВРеализацияТоваровУслуг И Объект.ИспользоватьВСписаниеТоваров Тогда
		Используется = "Р+С";
	Иначе
		Если Объект.ИспользоватьВРеализацияТоваровУслуг Тогда
			Используется = "Р";
		КонецЕсли; 
		Если Объект.ИспользоватьВСписаниеТоваров Тогда
			Используется = "С";
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
//Костенюк Александр-Старт 03.12.2012
Процедура ТипОплатыСписокПриИзменении(Элемент)
	
	Если ТипОплатыСписок = "Наличные" Тогда
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.Наличные");
	ИначеЕсли ТипОплатыСписок = "ПлатежнаяКарта" Тогда
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта");
	ИначеЕсли ТипОплатыСписок = "БанковскийКредит" Тогда
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БанковскийКредит");
	ИначеЕсли ТипОплатыСписок = "Чек" Тогда
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.Чек");
	ИначеЕсли ТипОплатыСписок = "БезналичныйРасчет" Тогда
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БезналичныйРасчет");
	Иначе
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПустаяСсылка");
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры
//Костенюк Александр-Финиш 03.12.2012

&НаКлиенте
//Костенюк Александр-Старт 03.12.2012
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.Наличные") Тогда
		ТипОплатыСписок = "Наличные";
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта") Тогда
		ТипОплатыСписок = "ПлатежнаяКарта";
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БанковскийКредит") Тогда
		ТипОплатыСписок = "БанковскийКредит";
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.Чек") Тогда
		ТипОплатыСписок = "Чек";
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БезналичныйРасчет") Тогда
		ТипОплатыСписок = "БезналичныйРасчет";
	Иначе
		ТипОплатыСписок = "";
	КонецЕсли;
	
КонецПроцедуры
//Костенюк Александр-Финиш 03.12.2012
